Documents/СводнаяОплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СводнаяОплата</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>тчДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ППК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ППК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Эквайрер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорЭквайринга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AbillsСписокТиповОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС14</Name>
					<Comment>(Общ) Ставка НДС 14%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийОплатаОтПокупателяПлатежнойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийОплатаОтПокупателяПлатежнойКартой</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СводнаяОплата/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;

Процедура СоздатьОплату(флОбменДанными = ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводнаяОплататчДанные.ППК КАК ППК,
		|	СводнаяОплататчДанные.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СводнаяОплататчДанные.ППК.Контрагент КАК Контрагент,
		|	СводнаяОплататчДанные.СуммаОплаты КАК СуммаДокумента,
		|	СводнаяОплататчДанные.СуммаОплаты КАК СуммаПлатежа,
		|	СводнаяОплататчДанные.СуммаОплаты КАК СуммаВзаиморасчетов,
		|	СводнаяОплататчДанные.ДоговорЭквайринга.ДоговорВзаиморасчетов.Организация КАК Организация,
		|	СводнаяОплататчДанные.Эквайрер КАК Эквайрер,
		|	&Валюта КАК ВалютаДокумента,
		|	&СтавкаНДС КАК СтавкаНДС,
		|	&ВидОперации КАК ВидОперации,
		|	&ВидОплаты,
		|	&КурсВзаиморасчетов,
		|	&КратностьВзаиморасчетов,
		|	СводнаяОплататчДанные.ДоговорЭквайринга,
		|	&СтатьяДДС КАК СтатьяДвиженияДенежныхСредств,
		|	&СчетРасчетов КАК СчетУчетаРасчетовСЭквайрером,
		|	&СчетРасчетовНдс КАК СчетУчетаНДС,
		|	&СчетУчетаНДСПодтвержденный,
		|	&СчетУчетаРасчетовСКонтрагентом,
		|	&СчетУчетаРасчетовПоАвансам,
		|	СводнаяОплататчДанные.ДоговорЭквайринга.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетовЭквайрера,
		|	СводнаяОплататчДанные.ДатаПлатежки,
		|	СводнаяОплататчДанные.НомерСтроки
		|ИЗ
		|	Документ.СводнаяОплата.тчДанные КАК СводнаяОплататчДанные
		|ГДЕ
		|	СводнаяОплататчДанные.Ссылка = &Ссылка
		|	И СводнаяОплататчДанные.ДокументОплаты = ЗНАЧЕНИЕ(Документ.ОплатаОтПокупателяПлатежнойКартой.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка"					      , Ссылка);
	Запрос.УстановитьПараметр("Валюта"					      , мВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("СтавкаНДС"				      , Перечисления.СтавкиНДС.БезНДС);
	Запрос.УстановитьПараметр("ВидОперации"				      , Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя);
	Запрос.УстановитьПараметр("ВидОплаты"				      , Справочники.ВидыОплатЧекаККМ.НайтиПоНаименованию("Платежная карта"));
	Запрос.УстановитьПараметр("КурсВзаиморасчетов"		      , 1);
	Запрос.УстановитьПараметр("КратностьВзаиморасчетов"		  , 1);
	Запрос.УстановитьПараметр("СтатьяДДС"					  , Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя);
	Запрос.УстановитьПараметр("СчетРасчетов"				  , ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте);//333
	Запрос.УстановитьПараметр("СчетРасчетовНдс"               , ПланыСчетов.Хозрасчетный.НалоговыйКредит);//6441
	Запрос.УстановитьПараметр("СчетУчетаНДСПодтвержденный"    , ПланыСчетов.Хозрасчетный.НалоговыйКредитНеподтвержденный);//6442
	Запрос.УстановитьПараметр("СчетУчетаРасчетовСКонтрагентом", ПланыСчетов.Хозрасчетный.НайтиПоКоду("3611"));//361
	Запрос.УстановитьПараметр("СчетУчетаРасчетовПоАвансам"    , ПланыСчетов.Хозрасчетный.НайтиПоКоду("3611"));//361
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	сч = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		сч = сч + 1;
		
		ДокОб 								= Документы.ОплатаОтПокупателяПлатежнойКартой.СоздатьДокумент();
		ДокОб.ОбменДанными.Загрузка			= флОбменДанными;
		ДокОб.Дата 							= ВыборкаДетальныеЗаписи.ДатаПлатежки;
		ДокОб.Ответственный 				= Ответственный;
		ДокОб.ДокументОснование				= Ссылка;
		//ДокОб.ОтражатьВУправленческомУчете 	= Истина;
		ДокОб.ОтражатьВБухгалтерскомУчете 	= Истина;
		
		ДокОб.Комментарий = "#Создано автоматический";
		
		ЗаполнитьЗначенияСвойств(ДокОб, ВыборкаДетальныеЗаписи);
		
		НовСтр = ДокОб.РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		
		Попытка
			//ДокОб.ОбменДанными.Загрузка = Истина;
			
			
			Если не ДокОб.Организация.А_УправленческийУчет Тогда 
				НовСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
				НовСтр.СчетУчетаНДС = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6432");;
				НовСтр.СчетУчетаНДСПодтвержденный = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6431");
				НовСтр.СуммаНДС = ВыборкаДетальныеЗаписи.суммаДокумента/6;
				ТипИсточника        = ТипЗнч(ДокОб);
				МетаданныеИсточника = ДокОб.Метаданные();
				
				А_Подписка.СформироватьДокументУУ(ДокОб, МетаданныеИсточника, ТипИсточника, Ложь, РежимПроведенияДокумента.Оперативный);
			КонецЕсли;
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);

		Исключение
			Сообщить(ОписаниеОшибки());
			сч = сч -1;
			Продолжить;
		КонецПопытки;
		СтрПоиска = Новый Структура;
		СтрПоиска.Вставить("НомерСтроки", ВыборкаДетальныеЗаписи.номерСтроки);
		тчДанные[ВыборкаДетальныеЗаписи.номерСтроки-1].ДокументОплаты = ДокОб.Ссылка;
		
	КонецЦикла;
	
	Сообщить(НСТР("ru='Создано " + сч+ " " + "документов'; uk = 'Створено " + сч+ " " + "докумнтів""'"));
	
	Записать();
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета")
